<?php
$backbtn = '🔙 بازگشت';

$home = [
    [['text'=>"🧐 راهنما"]],
    [['text'=>"🎤 ارسال ویس"], ['text'=>"🆕 جدیدترین ویس ها"]],
];

$adminpanel = [
    [['text'=>"🗑 حذف ویس"], ['text'=>"✏️ ویرایش ویس"]],
    [['text'=>"🖥 آمار"]],
    [['text'=>$backbtn]],
];

$editvoicepanel = [
    [['text'=>"✏️ ویرایش نام ویس"], ['text'=>"✏️ ویرایش صدای ویس"]],
    [['text'=>$backbtn]],
];

$yesnopanel = [
    [['text'=>"✅ بله"], ['text'=>"❌ خیر"]],
    [['text'=>$backbtn]],
];

$back = [
    [['text'=>$backbtn]],
];