<?php

$help_center = [
    [['text'=>"📄 راهنمای ارسال ویس"], ['text'=>"📄 راهنمای حریم خصوصی "]],
    [['text'=>$backbtn]]
];

if($text == '🧐 راهنما'){
  Bot('sendMessage',[
      'chat_id'=>$chat_id,
      'text'=>'ربات اوه پسر یک ربات عمومی و فان برای ارسال ویس های مختلف به چت ها در تلگرام می باشد. در (اوه پسر) شما میتوانید ویس های خودتان را به طور عمومی یا خصوصی در ربات اضافه کنید و با استفاده از ربات آنها را در چت های مختلف ارسال کنید. 🙂',
      'reply_markup'=>json_encode(['keyboard'=>$help_center ,'resize_keyboard'=>true
      ])
  ]);
}

if($text == '📄 راهنمای حریم خصوصی'){
  Bot('sendMessage',[
      'chat_id'=>$chat_id,
      'text'=>'▪️ تمامی ویس های موجود در ربات ارسالی کاربران ربات بوده و اوه پسر یک ربات واسطه برای قرار دادن و ارسال ویس های مختلف می باشد و تیم مدیریت اوه پسر هیچ مسعولیتی در برابر ویس های ارسالی ندارد.

▪️ربات اوه پسر با حفظ حقوق کاربران خود اجازه دسترسی مستقیم کاربران به دیتابیس اصلی اوه پسر را درصورت انجام عملیاتی در ربات میدهد و اگر ویسی باعث ارسال، حذف و... گردد، به طور کامل و مستقیم از دیتابیس اوه پسر حذف و غیر قابل دسترسی (حتی برای تیم مدیریت) قرار میگیرد.

▪️اوه پسر با استفاده از Unique id هر ویس که در سرور تلگرام آپلود شده ویس ها را بارگذاری و ذخیره میکند و ویس های ارسالی به صورت mp3 یا سایر فرمت ها در سرور ها ذخیره نخواهد شد.

▪️تمامی ویس های خصوصی اضافه شده توسط کاربران در ربات اوه پسر فقط در دسترس همان حساب کاربری میباشد و شخص دیگری امکان دسترسی به آن ویس را ندارد.

▪️ربات اوه پسر با احترام به سلایق و راحتی بیشتر کاربران ربات، امکان شخصی سازی ویس های نامناسب هم قرار داده است که اگر میخواهید ویس هایی که دارای نام های نامناسب (الفاظ رکیک و...) می باشند برای شما نمایش داده نشود میتوانید از تنظیمات ربات این شخصی سازی را انجام دهید.',
      'reply_markup'=>json_encode(['keyboard'=>$help_center ,'resize_keyboard'=>true
      ])
  ]);
}

if($text == '📄 راهنمای ارسال ویس'){
    $cap = '👈🏻 برای استفاده از ربات اوه پسر و ارسال ویس ها داخل چت مورد نظر، کافیه که عبارت زیر رو مانند عکس همراه با یک فاصله تایپ کنید :
@'.$CONFIG['CHANNEL']['OFFICIAL'].'
حتما حواست باشه بعد از اینکه این آیدی رو نوشتی یه فاصله هم بعدش بزاری تا لیست آخرین ویس های ثبت شده در ربات برات باز بشه 😛
😎بعد میتونی با نوشتن یک عبارت، ویس مورد نظرتو هم جستوجو کنی

اگر هم دیدی یه نفر یه ویسی رو فرستاد و خواستی ببینی اسم اون ویس چیه، میتونی اون ویس رو همینجا داخل ربات فوروارد کنی تا اسمشو بهت بگم 😆


راستی! جدای اون روش بالایی که بهت گفتم، میتونی با کلیک بر روی دکمه پایین هم چت مورد نظرتو انتخاب کنی تا منوی ربات برات باز بشه 👇🏻';
    SendPhoto($chat_id, 'https://t.me/'.$CONFIG['CHANNEL']['DATABASE'].'/76', json_encode(['inline_keyboard'=>[[['text'=>"🎤 ارسال یک ویس", 'switch_inline_query'=>'']]]]), $cap, null);
}
