<?php

if($text == '🧐 راهنما'){
    $cap = '👈🏻 برای استفاده از ربات اوه پسر و ارسال ویس ها داخل چت مورد نظر، کافیه که عبارت زیر رو مانند عکس همراه با یک فاصله تایپ کنید :
@'.$CONFIG['CHANNEL']['OFFICIAL'].'
حتما حواست باشه بعد از اینکه این آیدی رو نوشتی یه فاصله هم بعدش بزاری تا لیست آخرین ویس های ثبت شده در ربات برات باز بشه 😛
😎بعد میتونی با نوشتن یک عبارت، ویس مورد نظرتو هم جستوجو کنی

اگر هم دیدی یه نفر یه ویسی رو فرستاد و خواستی ببینی اسم اون ویس چیه، میتونی اون ویس رو همینجا داخل ربات فوروارد کنی تا اسمشو بهت بگم 😆


راستی! جدای اون روش بالایی که بهت گفتم، میتونی با کلیک بر روی دکمه پایین هم چت مورد نظرتو انتخاب کنی تا منوی ربات برات باز بشه 👇🏻';
    SendPhoto($chat_id, 'https://t.me/'.$CONFIG['CHANNEL']['DATABASE'].'/76', json_encode(['inline_keyboard'=>[[['text'=>"🎤 ارسال یک ویس", 'switch_inline_query'=>'']]]]), $cap, null);
}