<?php
$backbtn = '🔙 بازگشت';

$home = [
    [['text'=>"🧐 راهنما"]],
    [['text'=>"🎤 افزودن ویس"], ['text'=>"🗂 ویس های من"]],
    [['text'=>"🆕 جدیدترین ویس ها"], ['text'=>"❣️ محبوبترین ویس ها"]],
    [['text'=>"⚙️ تنظیمات"], ['text'=>"💬 ارتباط با مدیریت"]]
];

$adminpanel = [
    [['text'=>"🖥 آمار"]],
    [['text'=>"🗑 حذف ویس"], ['text'=>"✏️ ویرایش ویس"]],
    [['text'=>"💬 پیام همگانی"], ['text'=>"💬 فوروارد همگانی"]],
    [['text'=>$backbtn]]
];

$privateorpublic = [
    [['text'=>"🔓 عمومی"], ['text'=>"🔐 خصوصی"]],
    [['text'=>$backbtn]]
];

$editvoicepanel = [
    [['text'=>"✏️ ویرایش نام ویس"], ['text'=>"✏️ ویرایش صدای ویس"]],
    [['text'=>$backbtn]]
];

$yesnopanel = [
    [['text'=>"✅ بله"], ['text'=>"❌ خیر"]],
    [['text'=>$backbtn]]
];

$back = [[['text'=>$backbtn]]];